# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
# В случае с английским алфавитом очки распределяются так:
# A, E, I, O, U, L, N, S, T, R – 1 очко;
# D, G – 2 очка;
# B, C, M, P – 3 очка;
# F, H, V, W, Y – 4 очка;
# K – 5 очков;
# J, X – 8 очков;
# Q, Z – 10 очков.
# Напишите программу, которая вычисляет стоимость введенного пользователем слова. Будем считать, что на вход
# подается только одно слово, которое содержит либо только английские, либо только русские буквы.

dict = \
    {1: ["A", "E", "I", "O", "U", "L", "N", "S", "T", "R", "А", "В", "Е", "И", "Н", "О", "Р", "С", "Т"],
     2: ["D", "G", "Д", "К", "Л", "М", "П", "У"],
     3: ["B", "C", 'M', "P", "Б", "Г", "Ё", "Ь", "Я"],
     4: ["F", "H", "V", "W", "Y", "Й", "Ы"],
     5: ["K", "Ж", "З", "Х", "Ц", "Ч"],
     8: ["J", "X", "Ш", "Э", "Ю"],
     10: ["Q", "Z", "Ф", "Щ", "Ъ"]
     }
str = input("введите слово = ").upper()
scores = 0
for ch in str:
  for key, val in dict.items():
   if ch in val:
    scores += key
    break

print(scores)