# Найдите сумму цифр трехзначного числа. 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

a = int(input())
b = a//10-10
c = a//100
d = a-(a//10)*10
r = b+c+d
print(r)